const moment = require("moment-timezone");

module.exports.config = {
  name: "caption",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "—͟͟͞͞𝐂𝐘𝐁𝐄𝐑 ☢️_𖣘 -𝐁𝐎𝐓 ⚠️ 𝑻𝑬𝑨𝑴_ ☢️",
  description: "random caption",
  commandCategory: "caption",
  usages: "caption",
  cooldowns: 5
};

module.exports.handleEvent = async function ({ api, event, Users }) {
  const { threadID, messageID, body, senderID } = event;

  if (!body || !body.toLowerCase().startsWith("caption")) return;

  const name = await Users.getNameUser(senderID);
  const time = moment.tz("Asia/Dhaka").format("HH:mm:ss L");

  const tl = [
    "- এক'ম།ত্র ভরস། (الله)🕋🪽",
    "°\n\n -ভালো থাকুক ক্যাপশনে রিয়েক্ট না দেওয়া ব্রয়লার মুরগি'রা...!!🐸\n\n°",
    "বে্ঁয়া্ঁদ্ঁবি্ঁ মা্ঁপ্ঁ ক্ঁর্ঁবে্ঁন্ঁ🫡আ্ঁপ্ঁনা্ঁকে্ঁ এ্ঁক্ঁটা্ঁ থা্ঁপ্প্ঁর্ঁ মা্ঁর্ঁতে্ঁ চা্ঁই্ঁ⎯͢😑⎯⃝💙",
    "আমি হারায় যাইতে পারি এই ভয় কারো হয়নাই, আমি কারো কথায় রাগ করতে পারি এই চিন্তাও কারো কখনো হয়নাই। আমি ছিলাম, সব সময়, মানুষেরা না চাইতেও!🖤",
"দীর্ঘ সময়ের অপেক্ষা শেষে বুঝলাম, আমি মূলত শূন্যের দিকে তাকিয়ে ছিলাম....",
"কিছু আঘাত ক্ষমা করা যায়, কিন্তু ভুলে যাওয়া যায় না।
কথার কাঁটা সরে গেলেও, ব্যথা থেকে যায় হৃদয়ের গভীরে।
আমরা ক্ষমা করি, কারণ রব তাই শিখিয়েছেন—",
"তবে অন্তরের সেই দাগ, কখনো কখনো থেকে যায় নীরবে!",
"নিজেকে হারিয়ে তোমাকে জিতিয়ে দিলাম তোমার সুখ দীর্ঘ স্থায়ী হোক🖤🌸",
"তুমি আমার অপ্রকাশিত- গোপন এক সুখ.!🖤🌸",
"সাধনা কইরাও মানুষ ধইরা রাখা যায় না,সেখানে তুমি অবহেলা কইরাও আমায় সরাইতে পারোনি, কি অদ্ভুত!",
"- মানসিক শান্তি'ই বড় শান্তি->!!🩷'🌻",
"সবাই পরিচিত কিন্তু, আপন না!!😅",
"শুধু সামনে তাকিয়ে থাকা আর অপেক্ষা।💝",
"সমুদ্রের ঢেউগুলো যেন আমারই দীর্ঘশ্বাস।",
"খোলার আগে সবাই পাশে থাকে এখন কেউ পাশে নাই 😅💔",
"ঠিক কতদিন অপেক্ষা করলে একদিন সব ঠিক হয়ে যাবে?😅",
"আক্ষেপ জমতে জমতে একদিন হঠাৎ মন থেকে উঠে যাওয়ার যেই ব্যাপারটা😊!",
"বহু ইচ্ছের মাঝে আপাতত একটাই ইচ্ছে, যদি জীবন থেকে পালিয়ে যেতে পারতাম!❤️‍🩹",
"- এই জীবনটা আর ভালো লাগছে না, যদি পারতাম, জীবনটা ত্যাগ করে দিতে, কিন্তু তাও পারছি না..!!😊❤️‍🩹",
"জীবনে ধনী হওয়া জরুরি নয়,শান্তিতে থাকাটা অনেক বেশি গুরুত্বপূর্ণ..!☺️❤️‍🩹🖤",
"টাকার কাছে সব হারিয়ে যায় ..😅",
"গোটা জীবন নিঃসঙ্গতায় কাটুক, তবুও ভুল
মানুষ জীবনে না আসুক..!😌❤️‍🩹",
"আমার কখনোই কেউ ছিল না,কেউ নেই,কেউ থাকেনি,আমার আপন যেন কেবল'ই একাকীত্ব' আর প্রিয় মানুষদের স্মৃতি.!😅❤️‍🩹",
"চেনা গন্তব্যে ফেরা হয় রোজ'🙂
তুমি হয়ে গেলে স্বার্থপর আর আমি হয়ে গেলাম নিখোঁজ, 🙂💔",
"বাড়ি বানাতে বাড়ি ছাড়তে হয়.!👥❤️‍🩹
পুরুষ মানুষের জীবন 💜",
"জীবন যত সামনে যায়
বাস্তবতা তত কঠিন হয়..!😅❤️‍🩹",
"যন্ত্রণা সীমা ছাড়িয়ে গেলে,
"মানুষ কাদে না নীরব হয়ে যায়।❤️‍🩹😊",
"মানুষ শুনতে চায় সত্যটা,
কিন্তু বিশ্বাস করে মিথ্যাটা....!🗣️😅",
"যারা নিস্তব্ধতার মানে বোঝে না, তাদের কোনো কথায় বোঝানো যায় না।❤️‍🩹",
"যে প্রেম মরে গেছে
তার স্মৃতি মনে করিয়ে দিতে পৃথিবীতে এখনো বৃষ্টি আসে.!❤️‍🩹",
"বেশিরভাগ মানুষের জীবনের বড় একটা আফসোস হচ্ছে
“ছোট থাকতে ভাবতাম কবে যে বড় হবো, বড় হয়ে ভাবি কেন যে বড় হলাম!😅😅",
"এই আয়নার দিকেই যতবার তাকাইয়া ছিলাম, ততবারই ব্যর্থ হইলাম, আজকাল তাকানো'ও যাই না সহজেই, কি ছিলাম কি হয়ে গেলাম..!!😶",
"হারানোর তো আর কিছুই বাকি রইল না 😅 প্রতিটা জীনিস হারিয়ে একেবারে নিঃস্ব হয়ে গেছি 😥
আর এমন লাইফ থাকা না থাকা একোই সমান 😥",
"— কাঠগোলাপের কঠিন মায়া হৃদয়'কোণে রাখি..!🌸🌷",
"মানতে নেই , তবুও মেনে নিতে হয় বাস্তবতা! 😌",
"জীবন শেখায়, প্রতিনিয়ত মানুষ চেনায়, পৃথিবীর নিষ্ঠুর বাস্তবতা উপলব্ধি করায়।।☺️",
"প্রকৃতিক সৌন্দর্যের কাছে মানুষের সৌন্দর্য কিছুই না🥰",
"- জীবনের সবচেয়ে পছন্দের জিনিস গুলো হয়তো অবৈ*ধ,নয়তো নি*ষিদ্ধ,আবার হয়তো দামী,নয়তো অন্য কারোর..!😅💔",
"মায়া, শব্দটা ছোটা
হলেও, জীবনে অনেক
কিছু শিখিয়ে যায়.....!! 💔",
"প্রকৃতির প্রেমে পড়ো,
মানুষ তুচ্ছ মনে লাগবে 😊",
"আমার দেওয়া ফুল তার জীবনের সব দুঃখ-কষ্টে সান্ত্বনা হয়ে ওঠে।💝",
"হাজারটা চাঁদ আসলেও সে রাতের কোন মূল্য নাই,
  যদি তুমি না আসো!",
"তোমার প্রতি আমার ভালোবাসা সবসময়ই থাকবে..!🖤🙂🥀",
"তুমি চলে যাওয়ার সময়, স্মৃতিটাকে নিয়ে যেতে পারতে!🥲",
"অস্থায়ী মানুষের স্থায়ী মায়া 😅❤️‍🩹",
"জীবন যেনো এক অমীমাংসিত প্রশ্নের  মতো
কোথাও থেমে নেই কোথাও শান্তি নেই প্রতিটি পদক্ষেপ যেনো অন্ধকারে ঠেলে দেয় আজকাল মনে হয় একমাত্র স্রষ্টার কাছেই শেষ আশ্রয় বাকি সব কিছু যেনো অদঅদৃশ্য হয়ে গেছে 😊❤️‍🔥",
"হারানোর আগে ভেবে দেখিও , আবার যেন খুঁজতে না হয়।💝",
"কেউ বদনাম রটাবে আর কেউ সবটা জেনেও ভালবাসবে।",
"রঙিন হও তবে রং বদলেি ও না।,,😊💝",
"মৃত্যু মানুষ এর শোক কাটিয়ে উঠা যায়!
তবে মানুষটি বেঁচে আছে ভালো আছে কিন্তু আমার সাথে না অন্য কোনো মানুষের সাথে এই কষ্ট যে সহ্য করার মতো নয় 😅💔",
"বেঈমানদের হাসি সব সময় সুন্দর হয়ে থাকে এবং তাদের হাসি মূহুর্তেই পরিবর্তন করে ফেলতে পারেন! 💝",
"জীবনটা আটকে আছে এক‍ মায়াবতীর মায়ায়‌‍‍.সে তো বেশ সুখেই আছে অন্য কারোর ছোয়ায়!💔😞",
"মানুষ আনন্দের চেয়ে কষ্টের কথা বলতে বেশি পছন্দ করে সুখের কথা দুই বাক্যেই শেষ, কিন্তু দুঃখগাঁথা শুরু হলে আর শেষ হতে চায় না। তবে কি মানুষ দুঃখটাই বেশি ভালবাসে🖤",
"কষ্ট সেটা নয় যেটা আপনি মানুষের কাছে প্রকাশ করতে পারেন,,সত্যিকারের কষ্ট তো সেটা, যা আপনি কোনো মানুষের কাছে প্রকাশ করতে পারেন না। নীরবে নিভৃতে যা আপনাকে কাদিয়ে বেড়ায়😅",
"পৃথিবীর সবচেয়ে বড় গোরস্হান আপনার মস্তিষ্ক ।
কতে শখ, কতো স্মৃতি , কতো অভিমানকে নীরবে পুঁতে ফেলেছেন - কয়জন টের পেয়েছে ? 😅",
"বি’চ্ছেদের কোনো কারণ হয়না, যার বি’চ্ছেদের প্রয়োজন হয়, সে কারণ তৈরি করে নেয়.!❤️‍🩹",
"যাকে মন থেকে অনেকটা আপন ভাবা হয় তার অবহেলা সহ্য করা সত্যি খুব কষ্টকর হয়।🫠",
"তুমি সুন্দর বলে ভালোবাসি নাই আমি ভালোবাসি বলেই তুমি এত সুন্দর…❤️‍🔥",
"যেদিন তুমি হাজারো মানুষের ভিড়ে শুধুমাত্র একটা মানুষকে খুজবে, সেদিন বুঝবে তুমি ভালোবেসে ফেলেছো🫠💝 ।",
"আপনার সাথে দেখা করা ভাগ্য ছিল, আপনার বন্ধু হওয়া একটি পছন্দ ছিল, কিন্তু আপনার প্রেমে পড়া আমার নিয়ন্ত্রণের বাইরে ছিল।😅",
“এটা জীবনের একটি তিক্ত নীতি। জীবন যা দেয় তার চেয়ে বেশি কেড়ে নেয়।” 🙇‍♂️",
"একা দাঁড়ানোর সাহস রাখুন, পৃথিবী জ্ঞান দেয়, সঙ্গ দেয় না😊।",
“আমি সময় বদলানোর চেষ্টা করেছি। কিন্তু কে জানত সময় আমার জীবন বদলে দেবে😕।”
"যে মানুষটা সবচেয়ে কাছের ছিল, আজ সেই-ই সবচেয়ে দূরের 😊👍।""যখন মায়া বাড়িয়ে লাভ হয় না,তখন মায়া কাটাতে শিখতে হয় _-⎯⃝😅",
    "নাই কোনো অভিমান-অভিযোগ, ভাল থাকুক সে𑁍❀☹️",
    "সময়ের পরিবর্তনে রাগ, অভিমান কমে যায়,\n\n-কিন্তু কারো দেয়া আঘাতের দাগ গুলা থেকে যায়..! 😌",
    "মানুষ মাঝে মাঝে রাগ করতে করতে রাগের কারনটাই ভুলে যায়\n\n°`-শুধু থেকে যায় কিছু অভিমান..! 😊🤗",
    "°<নীরবতারও ভাষা আছে,এটা\n\n-শুধু খুব কাছের কেউই বুঝতে পারে।😊🙏",
    "প্রেমের সম্পর্ক অনেকটা পদ্ম পাতার ওপর এক ফোঁটা জলের মতো\n\n°`<যত্ন না করলে যে কোনো সময় 𑁍ভেঙ্গে যেতে পারে..! 🥰🫶",
    "অভিমানী মন অভিমানী এই রয়ে যায়\n\nতবুও কেউ অভিমান ভাঙাতে আসেনা.. 😅🤗",
    "অন্যের ওপরে অভিমান করে নিজেকে কষ্ট দেওয়া মানুষগুলি মারাত্মক বোকা..! 😵💔",
    "হয়তো তোমাকে হারিয়ে দিয়েছি নয় তো গিয়েছি হেরে থাক না ধ্রুপদী অস্পষ্টতাকে কাকে গেলাম ছেড়ে..  _-⎯⃝  🩷",
    "ধৈর্যশীল ব্যক্তির ক্রোধ থেকে সাবধান..!☠️🤝",
    "একমাত্র সৎ ব্যক্তিরাই অন্যকে কঠোরভাবে তিরস্কার করতে পারে😊🥰",
    "যে নদীর গভীরতা বেশি, তার বয়ে যাওয়ার শব্দ কম..!🤗",
    "তুমি যদি কোনো লোককে জানতে চাও\n\n-তাহলে তাকে প্রথমে ভালোবাসতে শেখো..!🥰",
    "সুন্দর একটা মানুষ না খুঁজে🤗\n\nসুন্দর একটা মন খুঁজো🥰\n\nতাহলে ভালোবাসার সফলতা আসবে..!😌",
    "প্রেম নারীর লজ্জাশীলতাকে গ্রাস করে\n\nপুরুষের বাড়ায়..!☠️🤝",
    "প্রেমের ক্ষেত্রে জয়ী হয়ে কেউ শিল্পী হতে পারে না\n\nবড় জোর বিয়ে করতে পারে..🤗",
    "একাকীত্ব তখনই মানুষ অনুভব করে\n\nযখন সে নিজের সাথে কথা বলে\n\nকারণ তখন কেউ তার কথা শোনার মত থাকে না..!🥰🫶",
    "বিচ্ছিন্নতার অনুভূতি সৃষ্টি করে একাকীত্ব..! _-✿︎\n\nযা পরিশেষে মানুষের জীবনকে চরম কষ্ট প্রদান করে.. _-⎯⃝ 🥰",
    "শূন্যতায় ভরা এ জগৎ সংসার\n\nসুখ-দুঃখ ভরা সব অতৃপ্তআত্না\n\n সুখ অনুভবে...তবু সুখ বলে কিছু নেই...দুঃখ সে তো শাশ্বত শূন্যের হাহাকার..!𑁍",
    "অসৎ মানুষের সঙ্গ লাভ করার থেকে নিঃসঙ্গতা ও একাকীত্ব অধিকতর শ্রেয়..!😊🤝",
    "অবসর সময়ে নিজের সঙ্গকে উপভোগ করার জন্য একাকিত্ব অপরিহার্য..!☹️🫶",
    "তুমি ছাড়া অন্য কোন কিছুই তোমাকে নিজের মত করে সুখী করতে সক্ষম নয়..!😊💔",
    "আজকাল আমরা সবাই নিজের ego satisfy করতে ব্যস্ত..☹️",
    "মাঝে মাঝেই ভাবি যে ভালো হয়ে যাবো\n\n-তারপরেই মনে হয় আমি খারাপ ছিলাম কবে..?🥱",
    "Perfect না হতে পারি..!\n\nতবে সস্তা নয়..!🥱",
    "যে অন্যের দোষ তোমাকে বলে..🙃\n\nসে নিশ্চয়ই তোমার দোষও অপরকে বলে.!😊🙏",
    "আমাকে ভাই বলার অধিকার শুধু আমার বন্ধুদের আছে..!🥰\n\nনয়তো শত্রুরা আজও আমাকে বাবা বলে ডাকে..!🥱🤝",
    "অন্যের মুখে শোনা কথা তাড়াতাড়ি না বিশ্বাস করাই ভালো..কারণ সত্যের তুলনায় মিথ্যা দ্রুতই ছড়িয়ে পড়ে..!😊",
    "তুমি জানো তুমি সঠিক..তবুও তুমি তর্কে যেও না.!😌",
    "মৃত্যু যেখানে সময়ের ব্যাপার মাত্র..সেখানে রঙিন স্বপ্ন বড়ই বে মানান..😌🫶",
    "দক্ষতা জিনিসগুলি সঠিকভাবে করছে..কার্যকারিতা সঠিক জিনিসগুলি করছে🥰🤝",
    "মানুষ খুব কমই সফল হয় যদি না তারা যা করছে তাতে আনন্দ পায়😌🙏",
    "নিজেকে ইতিবাচক ব্যক্তিদের চারপাশে ঘিরে রাখুন তাহলে আপনিও একজন ইতিবাচক ব্যক্তি হবেন..😊🫶",
    "মন খারাপ গুলোকে..হাসির আঁড়ালে লুকিয়ে..রাখার অভ্যাসটা আজও ছাড়তে পারলাম না!😊💔",
    "ছোট একটা ভুলের জন্য যে\n\nচিরদিনের জন্য ছেড়ে চলে যায়..\n\nসে আসলে কখনো পাশে থাকার যোগ্যই ছিলো না..!😊🤝",
    "জানি সে আমার নয়..!😌তবু তাকে হারানোর ভয়..😊🙏",
    "ভুল হলে শুধরে দেওয়াটা হচ্ছে ভালোবাসা..!\n\nফেলে চলে যাওয়াটা হচ্ছে বেইমানি..!😌💔",
    "মুখোশধারী ভদ্র হওয়ার চেয়ে..!😵\n\nস্পষ্টবাদী অভদ্র হওয়া অনেক ভালো..!😌",
    "Dear Ex আজও তোর কথা মনে পড়লে ভাবি আমার Choice এতটা খারাপ ছিল..!🥴🥱",
    "জীবনে সব কিছুকে আঁকড়ে ধরতে নেই..!😊💔",
    "আমি স্বার্থপর নই!\n\n-শুধু তাদের থেকে দুরে সরে যাই..\n\nযাদের কাছে আমার কোনো মূল্য নেই..!😊🫶",
    "🐰: কিছু ব্যাথা শব্দহীন ভাবে ভেতরটা তছনছ করে দেয় 😅\nডিপ্রেশন 😓🥀",
    "– হারিয়ে ফেলেছি মানসিক শান্তি!🙂🥹",
    "❝༆কারো আলোকিত শহরে হাটতে চাইনাツ࿐🙂",
    "🦋🥀°এই শহরে সবার’ই কষ্ট আছে.!🙂\n°কেউ কেউ প্রকাশ করে, আর কেউ হাসির মাধ্যমে উড়িয়ে দেয়.!🙂🖤",
    "লাইফে এমন কিছু ডিপ্রেশন আছে😥\nযা সৃষ্টিকর্তা ছাড়া কারো কাছে প্রকাশ করা যায় না🤲🥀"
  ];

  const rand = tl[Math.floor(Math.random() * tl.length)];

  return api.sendMessage({ body: rand }, threadID, messageID);
};

module.exports.run = () => {};
