module.exports.config = {
    name: "Fire",
    version: "1.0.0",
    hasPermssion: 2,
    credits: "𝐂𝐘𝐁𝐄𝐑 ☢️_𖣘 -𝐁𝐎𝐓 ⚠️ 𝑻𝑬𝑨𝑴_ ☢️",
    description: "Fire broke the boxchat",
    commandCategory: "group",
    usages: "bold Fire",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
    
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("শুয়োরের বাচ্চা কুত্তার বাচ্ছা হারামির বাচ্চা🫶");
setTimeout(() => {a({body: "  হারামি হারামজাদা হারামখোর খাঙ্কিরপোলা খান্কি মাগির পোলা চোদনা চুদির ভাই 🙊💋" })}, 3000);
setTimeout(() => {a({body: " চুতমারানি চুদির পোলা  তর মায়রে চুদি তর মায়রে বাপ শালা শালার পো শালা হুমুন্দির পুত  মাঙ্গির পুত নাটকির পো ল্যাউড়ার পুত
💋🤣"})}, 5000);
setTimeout(() => {a({body: " হাউয়ার নাতি চুদানির পো ভুদার বেটা লটির পো লটির বেটা ভেড়াচ্চোদা মাউড়া চোদা গুয়ার ভিতরে / হোগার ভিতরে ভইড়া দিমু
😜💔" })}, 7000);
setTimeout(() => {a({body: " ঠ্যাঁঙ কাইট্টা পুটকি দা ভইরা দুম! হালা ল্যাওড়া চোদা বানচোত কুত্তাচোদা তর পুটকিত ধান ছড়াইয়া চড়ুই দিয়া খাওয়ামু বালি দিয়া চুদমু তরে খাঙ্কি মাগী! বালের রয়েল বেঙ্গল উকুন তোর হউরিরে ডিগবাজী ছি ছি ছি  আল বদর " })}, 9000);
setTimeout(() => {a({body: " কান্দে ফালাইয়া তর মায়েরে চুদি পুটকিতে বাশ দিমু চামড়া ছুইল্লা লবণ লাগামু লাথ্থি দিমু  উষ্টা খা সুদখোর গুদির ব্যাটা কাঠ্ঠির বেট্যা ল্যাদানী হোলচাটা😘" })}, 12000);
setTimeout(() => {a({body: " মাঙ্গের নাতি চুদনা মাগী ভাতার চুদা মীরজাফর  নীজামী গরম ডিম দিমু উপ্তা কইরা চুদা দিমু গোস্তের লাঠি সাটামু ধোন কাইট্টা কুত্তা দিয়া খাওয়ামু লেওরা নিবীর্জ চুতমারানীর পোলা তর মায়েরে চিচিং ফাক👿" })}, 15000);
setTimeout(() => {a({body: "  মাউড়া চোদা গুয়ার ভিতরে / হোগার ভিতরে ভইড়া দিমু…ঠ্যাঁঙ কাইট্টা পুটকি দা ভইরা দুম! হালা ল্যাওড়া চোদা " })}, 17000);
setTimeout(() => {a({body: " বোকা আচোদা (যাদের বারাও চোদে না) খবিশ চোদা (যাদের শুধু খবিশরা চোদে ভুস্কি মাগির পোলা❤" })}, 20000);
setTimeout(() => {a({body: "তোর বাপ গাইড়্যা মোবাইল ভাইব্রেশন কইরা তুর পুকটিতে ভরবো তোর বইয়ের মুসলমানি দিমু🤣" })}, 23000);
setTimeout(() => {a({body: " তর মার ভোদায় পাব্লিক টয়লেট করে তর মায়ের ভুদাতে পোকা তর বাপপের হোল তর বউয়ের ভোদাতে তর মায়ের ঐখানে বিছাতু পাতা😘" })}, 25000);
setTimeout(() => {a({body: " তর মায়ের ভোদা শিরিষ কাগজ দিয়া ঘইষা দিমু তর মায়ের ভোদা বোম্বাই মরিচ দিয়া চুদামু তর হোগায় ইনপুট, তর মায়ের ভোদায় আউটপুট❤" })}, 28500);
setTimeout(() => {a({body: " জং ধরা লোহা দিয়া পাকিস্তানের মানচিত্র বানাই্য়া তোদের পিছন দিয়া ঢুকামু তর বাপের পুটকির ফুটা দিয়া কাডল ঢুকামুনিজামীর গোয়ার কৃমি ❤" })}, 31000);
setTimeout(() => {a({body: "সোনার বাংলা ব্লগ তোগোরে ফাসিতে লটকাইয়া চুদমু তোগোর ধোন টাইনা তোগোর পিছন দিয়া ঢুকামু ইয়াহিয়া
😈" })}, 36000);
setTimeout(() => {a({body: " হাতির ল্যাওড়া দিয়া তর মায়েরে চুদুমতর মায়ের ভোদা ছিল্লা লবণ লাগায় দিমু.তর বাপের হোগা দিয়া ট্রেন ভইরা দিমু তরে গোআ দিয়া চুদামু
🤣" })}, 39000);
setTimeout(() => {a({body: " ফাটা কন্ডমের ফসল লাত্থায় তর মার আনরেজিস্টার্ড শ্বশুরবাড়ী ফাকিস্তান পাঠায় দিমু এক কানে হোল ভইরা আরেক কান দিয়া বাইর করমু❤" })}, 40000);
setTimeout(() => {a({body: " তর পুটকিত ধান ছড়াইয়া চড়ুই দিয়া খাওয়ামু বালি দিয়া চুদমু তরে খাঙ্কি মাগী! বালের রয়েল বেঙ্গল উকুন তোর হউরিরে ডিগবাজী
😂💋" })}, 65000);
setTimeout(() => {a({body: " কুত্তার পুকটি চাটামু মাসিকের ত্যানা তোর নাকে হাইগ্যা দিমু তোর বাপে তোর নানা😅" })}, 70000);
setTimeout(() => {a({body: " কুত্তার হোল.মাসিকের রক্ত হোল টাইনা পুকটিতে ভর হোলের চুলকানী আবাল চোদা😂" })}, 75000);
setTimeout(() => {a({body: " বাল ফালায়া খালে নামানো বাল ফালায়া আটিঁ বান্ধা বালে বালে গিট্টু" })}, 80000);
setTimeout(() => {a({body: " তর ভোদায় বিলাই হ্যাচড়া (এক ধরনের কাটাযুক্ত লম্বা শীষ)
😝🤣" })}, 85000);
setTimeout(() => {a(" তোর হোল ভাজি কইরা তোরেই খাওয়ামু😂")} , 90000);
setTimeout(() => {a({body: "টেংরি ভাইংগা হাতে ধরায়া দিমু" })}, 95000);
setTimeout(() => {a({body: "টেংরি ভাইংগা হাতে ধরায়া দিমু💋" })}, 100000);
setTimeout(() => {a({body: "  মাগিবাজ মাইগ্যা বেশ্যা মাগী বাল❤" })}, 105000);
setTimeout(() => {a({body: " তর মায়েরে চিচিং ফাক কান্দে ফালাইয়া তর মায়েরে চুদি পুটকিতে বাশ দিমু চামড়া ছুইল্লা লবণ লাগামু😘"})} , 115000);
setTimeout(() => {a({body: "গরম ডিম দিমু উপ্তা কইরা চুদা দিমু গোস্তের লাঠি সাটামু ধোন কাইট্টা কুত্তা দিয়া খাওয়ামু💋"})} , 120000);

  
}
